[
  {
    "urlImage": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSzKpZPE3KQ8YkIcECUm6_Bng4UGRGPlUv-0w&usqp=CAU",
    "name": "Kompyuter arxitekturasi",
    "about": "Kompyuter arxitekturasi haqida ma'lumotlar",
    "urlBook": "https://library.samdu.uz/files/523933cb17de0c259e334105409c3eff_Kompyuter%20arxitekturasi.pdf",
    "discribtion": "Ushbu taqdim etilayotgan qo‘llanmada kompyuterning tuzulishi, uning ichki va\ntashqi qurilmalari keng yoritilib berilgan. Bo‘limning yakunida amaliy mashg‘ulotlar va\nlaboratoriya ishlarini qanday o‘tkazish kerakligi to‘g‘risida yo‘riqnomalar berilgan, hamda\ntest savollari keltirilgan.\nUshbu qo‘llanma O’zbekiston Respublikasi Oliy va o’rta maxsus ta’lim vazirligi\ntomonidan tasdiqlangan “Kompyuter arxitekturasi” fanining namunaviy fan dasturi asosida\nyozilgan bo’lib oliy o’guv uyrtlarida, kasb xunar kollejlari va akademik litseylarda ta’lim\nolayotgan o’quvchilar, hamda malaka oshirish markazlaridagi tinglovchilar uchun\nmo’ljallangan.",
    "stars": 4
  },
  {
    "urlImage": "https://static.review.uz/crop/3/9/825__95_3937200454.jpg?v=1593636546",
    "name": "ZAMONAVIY KOMPYUTERLARNI",
    "about": "Q o'llanm a ikkinchi to ‘Idirilgan (lotin alifbosiga asoslangan o'zbek yozuvidagi) nashri",
    "urlBook": "https://library.tsdi.uz/storage/books/March2022/rhLKzZHQva543ewpjYFY.pdf",
    "discribtion": "Informatika 60-yillarda Fransiya elektron hisoblash mashinalari yordamida axborotni qayta ishlash bilan shug‘ullanuvchi\nsohani ifodalovchi atama sifatida yuzaga keldi. Informatika\natamasi lotincha informatic so‘zidan kelib chiqqan b o ‘lib, tushuntirish xabar qilish, bayon etish ma’nolarini anglatadi. Fransuzcha infomiatique (informatika) so‘zi axborot avtomatikasi\nyoki axborotni avtomatik qayta ishlash m a’nosini anglatadi.\nIngliz tilida so‘zlashuvchi, mamlakatlarda bu atamaga Computer\nscienci (kompyuter texnikasi haqidagi fan) sinonimi mos keladi.",
    "stars": 3
  },
  {
    "urlImage": "https://www.texnoman.uz/uploads/blogs/4a51a6158edc3487c1fa355d55854535.jpeg",
    "name": "Zamonaviy inretnet",
    "about": "hozirgi kunda zamonaviy internetning insoniyat hayotida",
    "urlBook": "https://www.researchgate.net/publication/349102385_INTERNET_TARIXI",
    "discribtion": "Bugunga kelib internet insonlar hayotiga shunchalik singib ketganki, zamonaviy jamiyatni usiz tasavvur qilib bo'lmaydi. \"Butunjahon o'rgimchak to'ri\" yil sayin yangidan-yangi sohalarni qamrab olmoqda. Shunday ekan, Internet zamonamizning eng buyuk kashfiyotlari bilan bir qatorda turishga haqli. 20 yil oldin hech kim haqiqatan ham yaqin kelajakda chegarasiz butunjahon Internet paydo bo'ladi deb o'ylamagan edi. Internet uchun vaqt yoki millat yo'q, boylar va kambag'allarga bo'linish yo'q. Tarmoq shunchalik globalki, bugungi kunda kamchiliklar uning ishining nozik tomonlarini tushunishadi. Qaysi yilda Internet dunyoda paydo bo'lganligini eslang, uni kim yaratgan va biz tarmoq ta'rifining ko'rinishini tushunamiz. Yaratilgan yarim asrdan to bugungi kungacha Internet paydo bo'ldi, rivojlandi va tubdan o'zgardi. Va ayni paytda u o'zgarishni davom ettirmoqda. Internet boshqa davrda yaratilgan va shaxsiy kompyuterlar, mijozlar serverlari va kompyuter tarmoqlari davrida omon qolishga muvaffaq bo'lgan. Shu bilan birga, u nafaqat tirik qoldi, balki har qanday kompyuterning ajralmas qismiga aylandi. Internet rivojlandi, hatto lokal tarmoqlar paydo bo'lishidan oldin, bu ularning prototipiga aylandi va nafaqat mahalliy tarmoqni, balki global tarmoqni ham rivojlantirdi. Internetdan foydalanmaydigan kompyuter foydalanuvchisini tasavvur qilish qiyin. Ammo buning maqsadi nima? Internetning asosiy g'oyasi-bu ma'lumotlarning erkin oqimi. Internet tufayli odamlar yoki mamlakatlar o'rtasidagi irqiy, diniy va mafkuraviy to'siqlar bartaraf etilmoqda. Internetni osongina eng ta'sirli demokratik texnologik jarayon yutuqlaridan biri deb atash mumkin",
    "stars": 5
  } ,
  {
    "urlImage": "https://mininnovation.uz/media/post_images/STARTUPit.jpg",
    "name": "Axborot texnologiyalari...",
    "about": "Prezident Shavkat Mirziyoyev 24-dekabr kuni axborot-",
    "urlBook": "https://egov.uz/oz/news/axborot-texnologiyalari-sohasidagi-rejalar-taqdimot-qilindi-173",
    "discribtion": "Axborot texnologiyalari barcha sohalarda samaradorlik va qulaylikka xizmat qiladi. Shu bois bu borada ko‘lamli ishlar amalga oshirilmoqda. Joylarda 100 dan ortiq IT-maktablar faoliyati yo‘lga qo‘yildi. “Bir million dasturchi” loyihasi doirasida 500 mingdan ziyod yoshlar dasturlashni o‘rgandi.\n\nIT-parklar tashkil etilganidan buyon sohada eksport hajmi 50 barobarga ko‘payib, 40 million dollarga yetdi. Rezidentlar soni 147 tadan 500 taga oshdi, 300 dan ziyod yangi kompaniyalar faoliyati yo‘lga qo‘yildi. IT-parklarda 8 ming 500 ta yuqori daromadli ish o‘rinlari yaratildi.\n\nBunday ishlarni davom ettirib, soha rivojini yangi bosqichga ko‘tarish bo‘yicha rejalar ishlab chiqilgan. Xususan, yirik eksportyorlar bilan ishlab, IT-parklarda xizmatlar eksporti hajmini 80 million dollarga yetkazish mo‘ljallangan. Yalpi ichki mahsulotda raqamli iqtisodiyot ulushini oshirish, elektron xizmatlar uchun yengilliklar yaratish nazarda tutilgan.\n\nTaqdimotda shu borada taklif etilayotgan chora-tadbirlar ko‘rib chiqildi.\n\nDavlatimiz rahbari kelgusi yilda IT xizmatlar hajmini 35 foiz oshirib, 21 trillion so‘mga yetkazish, dasturlash xizmatlarini ko‘paytirish uchun barcha imkoniyat borligini ta’kidladi.\n\nSun’iy intellekt markazini ishga tushirishni jadallashtirish, xorijdan IT mutaxassislar jalb etish tartibini soddalashtirish bo‘yicha ko‘rsatmalar berildi.\n\nAxborot texnologiyalari va kommunikatsiyalarini rivojlantirish vazirligiga kelgusi yilda IT tarmoqlar tezligini 1,8 barobar oshirish hamda 1 million qo‘shimcha keng polosali tarmoqlar o‘rnatish vazifasi qo‘yildi. Bu orqali aholi punktlarining barchasi mobil aloqa va keng polosali internet bilan ta’minlanadi.\n\nPrezident yangi texnologiyalar, avvalo, odamlarga xizmat qilishi,  qulaylik yaratishi zarurligini ta’kidladi. Oxirgi yillarda 300 dan ortiq davlat xizmati elektron shaklga o‘tkazilib, shu yilning o‘zida ulardan 16 million marotaba foydalanilgan.\n\nKelgusi yilda Yagona interaktiv davlat xizmatlari portali orqali ko‘rsatiladigan xizmatlar ulushi 60 foizga yetkazilishi belgilandi.\n\nTaqdimotda bu boradagi yana bir qulaylik: fuqaro pasportining raqamli profili haqida ma’lumot berildi. Gov Pass mobil ilovasi smartfonga o‘rnatiladi va unda pasport, diplom, mehnat daftarchasi, haydovchilik guvohnomasi kabi ko‘plab hujjatlar jamlanadi. Ya’ni, fuqaroning barcha hujjatlari doim yonida, telefonda bo‘ladi. Bu vaqt va pulni tejab, qog‘ozbozlikni kamaytirishga xizmat qiladi, ovoragarchiliklarni bartaraf etadi.\n\n“Xavfsiz shahar” tizimi ijrosiga doir masalalarga ham alohida e’tibor qaratildi. 2026-yilgacha bu tizimni to‘liq joriy etish vazifasi qo‘yildi.",
    "stars": 2
  }
]